app/controllers/explore_controller.rb

    def search
        @search = params[:search] ? params[:search] : {}
        flash[:search_result] = Bird.find_by(name: @search)
---
SELECT  "birds".* FROM "birds" WHERE "birds"."name" = ? LIMIT 1  [["name", "Im so cool"]]

    def view
        #Bird.delete_all
        #Bird.create({:locationX => -25.363, :locationY => 131.044, :name => 'uluru'})
        #Bird.create({:locationX => -5.363, :locationY => 131.044, :name => 'uluru2'})
        if flash[:search_result] != nil
            @birds = flash[:search_result].as_json
        else
            @birds = Bird.all.as_json
---
SELECT "birds".* FROM "birds"