app/views/explore/explore.html.haml

SELECT "birds".* FROM "birds"
INSERT INTO "birds" ("locationX", "locationY", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["locationX", -25.363], ["locationY", 131.044], ["name", "uluru"], ["created_at", "2016-10-20 05:26:59.424780"], ["updated_at", "2016-10-20 05:26:59.424780"]]
---
        var birds = [];
        for (var i = 0; i < gon.birds.length; i++) {
          bird = gon.birds[i];
          birds.push({lat: bird.locationX, lng: bird.locationY});